{"_id":{"$oid":"617afc28f206a49fad42a31a"},"author_id":"kelsey-butler","name":"Kelsey Butler","imageUrl":"https://feastgood.com/wp-content/uploads/2022/02/Kelsey.jpg","subName":"MS, RDN","description":"<p>Kelsey Butler is a Registered Dietitian and recipe developer. Kelsey found a love for creating delicious recipes. Now, with a Master’s in Nutritional Sciences, Kelsey uses her culinary skills to create healthy and unique recipes for many different diets. She is passionate about creating a healthy relationship with all foods and recipes that everyone can enjoy.</p> <p>She is an expert in nutrition research, coaching, content creation, and recipe development. Kelsey takes a mindful approach towards health and values building relationships with all foods. She understands the importance of providing recipes that anyone can enjoy, no matter their dietary needs.</p> <p>When she’s not focusing on nutrition, Kelsey has a passion for cooking, the outdoors, running, and travel.</p>","social":{"instagram":"https://www.instagram.com/nurtureyou_health","tiktok":""},"metaData":{"title":"Kelsey Butler, MS, RDN, Author at Awesome Smoothie","description":"Kelsey Butler is a Registered Dietitian Nutritionist with a Master’s in Nutrition Sciences. She is an expert in nutrition research, coaching, content creation, and recipe development."},"recipes":[]}
{"_id":{"$oid":"617afc28f206a49fad41231a"},"author_id":"kaivan-dave","name":"Kaivan Dave","imageUrl":"https://ga-core.s3.amazonaws.com/production/uploads/instructor/image/14651/Kaivan_Dave.jpg","subName":"Smoothie Master ","description":"<p>Kaivan Dave, B.A., is a full-stack marketer, entrepreneur, and creator in the direct-to-consumer space. He has a degree in Marketing & Management from DePaul University. His work has been featured in The Huffington Post, Yahoo, and GQ Magazine.</p><p>Kaivan writes and speaks regularly about growth marketing, branding, digital media, and health & wellness topics that are focused around plant-based lifestyle, health & nutrition.</p><p>Kaivan is building the world's most delicious plant-based protein coffee. It has simple ingredients and powerful nutrition, and it’s called Awesome Coffee. You can learn more about Awesome Coffee by visiting their website at awesomecoffee.com.</p>","social":{"instagram":"https://www.instagram.com/KaivanDave","tiktok":"https://tiktok.com/@kaivandave"},"metaData":{"title":"Kaivan Dave, Author at Awesome Smoothie","description":"Kaivan Dave, B.A., is an entrepreneur and full-stack marketer. He regularly writes and speaks on topics such as growth marketing, branding, digital media, and plant-based health and nutrition."},"recipes":[]}
