
  {
    "_id": {
      "$oid": "618e5c6af206a49fada17766"
    },
    "category_id": "post-workout-shake",
    "main_title": "Post workout shakes",
    "secondary_title": "Post workout shakes --Detox smoothies for weight loss",
    "main_description": "Post workout shakes-- Healthy smoothies for weight loss are made with the right blend of weight loss foods that are scientifically proven to decrease body fat. Some of the common ingredients we include in these smoothies for weight loss are: protein powder for weight loss: these powders are low in sugar or other sweeteners, low in calories, and rich in high-quality protein that, in combination with strength exercises, will help build metabolism-boosting muscle mass. healthy fats: healthy fats like nut butters, avocado, and MCT oil will help to slow digestion to keep you fuller longer to prevent overeating. fiber: consuming fiber-rich ingredients like chia seeds, flaxseeds, hemp seeds, leafy greens, and oats can help prevent spikes in blood sugar that can lead to the storage of carbs as fat. low sugar: fruit is the base of all smoothies, and because fruit naturally contains sugar, there's no need to add extra sweeteners like honey, orange juice, or frozen yogurt that only serve to add empty calories",
    "secondary_description": "After Workout Shake Healthy smoothies for weight loss are made with the right blend of weight loss foods that are scientifically proven to decrease body fat. Some of the common ingredients we include in these smoothies for weight loss are: protein powder for weight loss: these powders are low in sugar or other sweeteners, low in calories, and rich in high-quality protein that, in combination with strength exercises, will help build metabolism-boosting muscle mass. healthy fats: healthy fats like nut butters, avocado, and MCT oil will help to slow digestion to keep you fuller longer to prevent overeating. fiber: consuming fiber-rich ingredients like chia seeds, flaxseeds, hemp seeds, leafy greens, and oats can help prevent spikes in blood sugar that can lead to the storage of carbs as fat. low sugar: fruit is the base of all smoothies, and because fruit naturally contains sugar, there's no need to add extra sweeteners like honey, orange juice, or frozen yogurt that only serve to add empty calories",
    "items": [
      {
        "title": "Simple + Healthier Snacking Options",
        "description": "I often snack throughout the day as opposed to eating 3 larger meals. I eat to break up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      },
      {
        "title": "22Simple + Healthier Snacking Options",
        "description": "22I often snack throughout the day as opposed to eating 3 larger meals. I eat to break up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      },
      {
        "title": "33Simple + Healthier Snacking Options",
        "description": "333I often snack throughout the day as opposed to eating 3 larger meals. I eat to break up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      }
    ],
    "category_banner_description": "We have [count] recipes that will help you after work out",
    "category_banner_img": "https://storage.googleapis.com/smoothie_bucket/banners/Post%20workout%20shakes.png",
    "preview_img": "https://storage.googleapis.com/smoothie_bucket/category-cards/homepage_section_2_1.png",
    "meta_data": {
      "title": "Healthy Post workout shakes",
      "description": "",
      "keyword_group": "Post workout shakes"
    }
  }
  {
    "_id": {
      "$oid": "618e5cb7f206a49fada1777d"
    },
    "category_id": "meal-replacement-shakes",
    "main_title": "Meal Replacement Shakes",
    "secondary_title": "Meal Replacement Shakes --Detox smoothies for weight loss",
    "main_description": "Meal Replacement Shakes -- Healthy smoothies for weight loss are made with the right blend of weight loss foods that are scientifically proven to decrease body fat. Some of the common ingredients we include in these smoothies for weight loss are: protein powder for weight loss: these powders are low in sugar or other sweeteners, low in calories, and rich in high-quality protein that, in combination with strength exercises, will help build metabolism-boosting muscle mass. healthy fats: healthy fats like nut butters, avocado, and MCT oil will help to slow digestion to keep you fuller longer to prevent overeating. fiber: consuming fiber-rich ingredients like chia seeds, flaxseeds, hemp seeds, leafy greens, and oats can help prevent spikes in blood sugar that can lead to the storage of carbs as fat. low sugar: fruit is the base of all smoothies, and because fruit naturally contains sugar, there's no need to add extra sweeteners like honey, orange juice, or frozen yogurt that only serve to add empty calories",
    "secondary_description": "After Workout Shake  Healthy smoothies for weight loss are made with the right blend of weight loss foods that are scientifically proven to decrease body fat. Some of the common ingredients we include in these smoothies for weight loss are: protein powder for weight loss: these powders are low in sugar or other sweeteners, low in calories, and rich in high-quality protein that, in combination with strength exercises, will help build metabolism-boosting muscle mass. healthy fats: healthy fats like nut butters, avocado, and MCT oil will help to slow digestion to keep you fuller longer to prevent overeating. fiber: consuming fiber-rich ingredients like chia seeds, flaxseeds, hemp seeds, leafy greens, and oats can help prevent spikes in blood sugar that can lead to the storage of carbs as fat. low sugar: fruit is the base of all smoothies, and because fruit naturally contains sugar, there's no need to add extra sweeteners like honey, orange juice, or frozen yogurt that only serve to add empty calories",
    "items": [
      {
        "title": "Simple + Meal Replacement Shakes",
        "description": "I often snack throughout the day as opposed to eating 3 larger meals. I eat to break up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      },
      {
        "title": "22Simple + Meal Replacement Shakes",
        "description": "22I often snack throughout the day as opposed to eating 3 larger meals. I eat to break up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      },
      {
        "title": "33Simple + Meal Replacement Shakes",
        "description": "333I often snack throughout the day as opposed to eating 3 larger meals. I eat to break up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      }
    ],
    "category_banner_description": "We have [count] recipes Meal Replacement Shakes",
    "category_banner_img": "https://storage.googleapis.com/smoothie_bucket/banners/meal-replacement-shakes.jpeg",
    "preview_img": "https://storage.googleapis.com/smoothie_bucket/category-cards/homepage_section_2_1.png",
    "meta_data": {
      "title": "Healthy Meal Replacement Smoothies",
      "description": "Each meal replacement smoothie recipe is packed with simple ingredients, powerful nutrition, and is ready instantly. High Protein. Low Carbs. Smooth, creamy, and rich smoothie and shake recipes.",
      "keyword_group": "Meal Replacement Smoothies"
    }
  }
  {
    "_id": {
      "$oid": "618e5ce2f206a49fada1778c"
    },
    "category_id": "weight-loss-shakes",
    "main_title": "Weight Loss Shakes",
    "secondary_title": "Weight Loss Shakes --Detox smoothies for weight loss",
    "main_description": "Weight Loss Shakes -- Healthy smoothies for weight loss are made with the right blend of weight loss foods that are scientifically proven to decrease body fat. Some of the common ingredients we include in these smoothies for weight loss are: protein powder for weight loss: these powders are low in sugar or other sweeteners, low in calories, and rich in high-quality protein that, in combination with strength exercises, will help build metabolism-boosting muscle mass. healthy fats: healthy fats like nut butters, avocado, and MCT oil will help to slow digestion to keep you fuller longer to prevent overeating. fiber: consuming fiber-rich ingredients like chia seeds, flaxseeds, hemp seeds, leafy greens, and oats can help prevent spikes in blood sugar that can lead to the storage of carbs as fat. low sugar: fruit is the base of all smoothies, and because fruit naturally contains sugar, there's no need to add extra sweeteners like honey, orange juice, or frozen yogurt that only serve to add empty calories",
    "secondary_description": "Weight Loss Shakes  Healthy smoothies for weight loss are made with the right blend of weight loss foods that are scientifically proven to decrease body fat. Some of the common ingredients we include in these smoothies for weight loss are: protein powder for weight loss: these powders are low in sugar or other sweeteners, low in calories, and rich in high-quality protein that, in combination with strength exercises, will help build metabolism-boosting muscle mass. healthy fats: healthy fats like nut butters, avocado, and MCT oil will help to slow digestion to keep you fuller longer to prevent overeating. fiber: consuming fiber-rich ingredients like chia seeds, flaxseeds, hemp seeds, leafy greens, and oats can help prevent spikes in blood sugar that can lead to the storage of carbs as fat. low sugar: fruit is the base of all smoothies, and because fruit naturally contains sugar, there's no need to add extra sweeteners like honey, orange juice, or frozen yogurt that only serve to add empty calories",
    "items": [
      {
        "title": "Simple + Weight Loss Shakes",
        "description": "I often snack throughout the day as opposed to eating 3 larger meals. I eat to break up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      },
      {
        "title": "22Simple + Weight Loss Shakes",
        "description": "22I often snack throughout the day as opposed to eating 3 larger meals. I eat to break up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      },
      {
        "title": "33Simple + Weight Loss Shakes",
        "description": "333I often snack throughout the day as opposed to eating 3 larger meals. I eat to break up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      }
    ],
    "category_banner_description": "We have [count] recipes will help you Weight Loss Shakes",
    "category_banner_img": "https://storage.googleapis.com/smoothie_bucket/banners/Weight%20Loss%20Shakes.png",
    "preview_img": "https://storage.googleapis.com/smoothie_bucket/category-cards/homepage_section_2_3.png",
    "meta_data": {
      "title": "Best Protein Shakes For Weight Loss",
      "description": "Each Weight Loss shakes recipe is packed with simple ingredients, powerful nutrition, and ready instantly. High Protein. Low Carbs. Smooth, Creamy, and Rich shakes recipes.",
      "keyword_group": "Weight Loss Shakes"
    }
  }
  {
    "_id": {
      "$oid": "618f73cbf206a49fada17d21"
    },
    "category_id": "muscle-gain-shakes",
    "main_title": "Muscle Gain Shakes",
    "secondary_title": "Muscle Gain Shakes --Detox smoothies for weight loss",
    "main_description": "Muscle Gain Shakes -- Healthy smoothies for weight loss are made with the right blend of weight loss foods that are scientifically proven to decrease body fat. Some of the common ingredients we include in these smoothies for weight loss are: protein powder for weight loss: these powders are low in sugar or other sweeteners, low in calories, and rich in high-quality protein that, in combination with strength exercises, will help build metabolism-boosting muscle mass. healthy fats: healthy fats like nut butters, avocado, and MCT oil will help to slow digestion to keep you fuller longer to prevent overeating. fiber: consuming fiber-rich ingredients like chia seeds, flaxseeds, hemp seeds, leafy greens, and oats can help prevent spikes in blood sugar that can lead to the storage of carbs as fat. low sugar: fruit is the base of all smoothies, and because fruit naturally contains sugar, there's no need to add extra sweeteners like honey, orange juice, or frozen yogurt that only serve to add empty calories",
    "secondary_description": "AMuscle Gain Shakes  Healthy smoothies for weight loss are made with the right blend of weight loss foods that are scientifically proven to decrease body fat. Some of the common ingredients we include in these smoothies for weight loss are: protein powder for weight loss: these powders are low in sugar or other sweeteners, low in calories, and rich in high-quality protein that, in combination with strength exercises, will help build metabolism-boosting muscle mass. healthy fats: healthy fats like nut butters, avocado, and MCT oil will help to slow digestion to keep you fuller longer to prevent overeating. fiber: consuming fiber-rich ingredients like chia seeds, flaxseeds, hemp seeds, leafy greens, and oats can help prevent spikes in blood sugar that can lead to the storage of carbs as fat. low sugar: fruit is the base of all smoothies, and because fruit naturally contains sugar, there's no need to add extra sweeteners like honey, orange juice, or frozen yogurt that only serve to add empty calories",
    "items": [
      {
        "title": "Simple + Muscle Gain Shakes",
        "description": "Muscle Gain Shakes the day as opposed to eating 3 larger meals. I eat to break up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      },
      {
        "title": "22Simple + Muscle Gain Shakes",
        "description": "Muscle Gain Shakes the day as opposed to eating 3 larger meals. I eat to break up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      },
      {
        "title": "33Simple + Muscle Gain Shakes",
        "description": "Muscle Gain Shakes the day as opposed to eating 3 larger meals. I eat to break up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      }
    ],
    "category_banner_description": "We have [count] recipes  - Muscle Gain Shakes",
    "category_banner_img": "https://storage.googleapis.com/smoothie_bucket/banners/Muscle%20Gain%20Shakes.png",
    "preview_img": "https://storage.googleapis.com/smoothie_bucket/category-cards/homepage_section_2_4.png",
    "meta_data": {
      "title": "Best Protein Shakes For Muscle Gains",
      "description": "Each muscle gain shakes recipe is packed with simple ingredients, powerful nutrition, and ready instantly. High Protein. Low Carbs. Smooth, Creamy, and Rich smoothies & shakes recipes.",
      "keyword_group": "Muscle Gain Shakes"
    }
  }
  {
    "_id": {
      "$oid": "618f7419f206a49fada17d39"
    },
    "category_id": "high-calorie-protein-shakes",
    "main_title": "High Calorie Protein Shakes",
    "secondary_title": "High Calorie Protein Shakes --Detox smoothies for weight loss",
    "main_description": "High Calorie Protein Shakes -- Healthy smoothies for weight loss are made with the right blend of weight loss foods that are scientifically proven to decrease body fat. Some of the common ingredients we include in these smoothies for weight loss are: protein powder for weight loss: these powders are low in sugar or other sweeteners, low in calories, and rich in high-quality protein that, in combination with strength exercises, will help build metabolism-boosting muscle mass. healthy fats: healthy fats like nut butters, avocado, and MCT oil will help to slow digestion to keep you fuller longer to prevent overeating. fiber: consuming fiber-rich ingredients like chia seeds, flaxseeds, hemp seeds, leafy greens, and oats can help prevent spikes in blood sugar that can lead to the storage of carbs as fat. low sugar: fruit is the base of all smoothies, and because fruit naturally contains sugar, there's no need to add extra sweeteners like honey, orange juice, or frozen yogurt that only serve to add empty calories",
    "secondary_description": "High Calorie Protein Shakes  Healthy smoothies for weight loss are made with the right blend of weight loss foods that are scientifically proven to decrease body fat. Some of the common ingredients we include in these smoothies for weight loss are: protein powder for weight loss: these powders are low in sugar or other sweeteners, low in calories, and rich in high-quality protein that, in combination with strength exercises, will help build metabolism-boosting muscle mass. healthy fats: healthy fats like nut butters, avocado, and MCT oil will help to slow digestion to keep you fuller longer to prevent overeating. fiber: consuming fiber-rich ingredients like chia seeds, flaxseeds, hemp seeds, leafy greens, and oats can help prevent spikes in blood sugar that can lead to the storage of carbs as fat. low sugar: fruit is the base of all smoothies, and because fruit naturally contains sugar, there's no need to add extra sweeteners like honey, orange juice, or frozen yogurt that only serve to add empty calories",
    "items": [
      {
        "title": "Simple + High Calorie Protein Shakes",
        "description": "MHigh Calorie Protein Shakes the day as opposed to eating 3 larger meals. I eat to break up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      },
      {
        "title": "22Simple + High Calorie Protein Shakes",
        "description": "High Calorie Protein Shakes the day as opposed to eating 3 larger meals. I eat to break up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      },
      {
        "title": "33Simple + High Calorie Protein Shakes",
        "description": "MHigh Calorie Protein Shakes the day as opposed to eating 3 larger meals. I eat to break up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      }
    ],
    "category_banner_description": "We have [count] recipes  - High Calorie Protein Shakes",
    "category_banner_img": "https://storage.googleapis.com/smoothie_bucket/banners/High%20Calorie%20Protein%20Shakes.png",
    "preview_img": "https://storage.googleapis.com/smoothie_bucket/category-cards/homepage_section_1_1.png",
    "meta_data": {
      "title": "Best High Calorie Protein Shakes",
      "description": "Each high calorie protein shake recipe is packed with simple ingredients, powerful nutrition, and is ready instantly. High Protein. Low Carbs. Smooth, creamy, and rich smoothie and shake recipes.",
      "keyword_group": "High Calorie Protein Shakes"
    }
  }
  {
    "_id": {
      "$oid": "6190cf3bf206a49fada18d55"
    },
    "category_id": "low-carb-shakes",
    "main_title": "Low Carb Shakes",
    "secondary_title": "Low Carb Shakes --Detox smoothies for weight loss",
    "main_description": "HLow Carb Shakes -- Healthy smoothies for weight loss are made with the right blend of weight loss foods that are scientifically proven to decrease body fat. Some of the common ingredients we include in these smoothies for weight loss are: protein powder for weight loss: these powders are low in sugar or other sweeteners, low in calories, and rich in high-quality protein that, in combination with strength exercises, will help build metabolism-boosting muscle mass. healthy fats: healthy fats like nut butters, avocado, and MCT oil will help to slow digestion to keep you fuller longer to prevent overeating. fiber: consuming fiber-rich ingredients like chia seeds, flaxseeds, hemp seeds, leafy greens, and oats can help prevent spikes in blood sugar that can lead to the storage of carbs as fat. low sugar: fruit is the base of all smoothies, and because fruit naturally contains sugar, there's no need to add extra sweeteners like honey, orange juice, or frozen yogurt that only serve to add empty calories",
    "secondary_description": "Low Carb Shakes  Healthy smoothies for weight loss are made with the right blend of weight loss foods that are scientifically proven to decrease body fat. Some of the common ingredients we include in these smoothies for weight loss are: protein powder for weight loss: these powders are low in sugar or other sweeteners, low in calories, and rich in high-quality protein that, in combination with strength exercises, will help build metabolism-boosting muscle mass. healthy fats: healthy fats like nut butters, avocado, and MCT oil will help to slow digestion to keep you fuller longer to prevent overeating. fiber: consuming fiber-rich ingredients like chia seeds, flaxseeds, hemp seeds, leafy greens, and oats can help prevent spikes in blood sugar that can lead to the storage of carbs as fat. low sugar: fruit is the base of all smoothies, and because fruit naturally contains sugar, there's no need to add extra sweeteners like honey, orange juice, or frozen yogurt that only serve to add empty calories",
    "items": [
      {
        "title": "Simple + Low Carb Shakes",
        "description": "MHigh Calorie Protein Shakes the day as opposed to eating 3 larger meals. I eat to break up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      },
      {
        "title": "22Simple + Low Carb Shakes",
        "description": "High Calorie Protein Shakes the day as opposed to eating 3 larger meals. I eat to break up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      },
      {
        "title": "33Simple + Low Carb Shakes",
        "description": "MHigh Calorie Protein Shakes the day as opposed to eating 3 larger meals. I eat to break up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      }
    ],
    "category_banner_description": "We have [count] recipes  - Low Carb Shakes",
    "category_banner_img": "https://storage.googleapis.com/smoothie_bucket/banners/Low%20Carb%20Shakes.png",
    "preview_img": "https://storage.googleapis.com/smoothie_bucket/category-cards/homepage_section_1_2.png",
    "meta_data": {
      "title": "Best Low Carb Protein Shakes Recipes",
      "description": "Each low carb protein shakes recipe is packed with simple ingredients, powerful nutrition, and is ready instantly. High Protein. Low Carbs. Smooth, creamy, and rich smoothie and shake recipes.",
      "keyword_group": "Low Carb Protein Shakes"
    }
  }
  {
    "_id": {
      "$oid": "6190d01af206a49fada18d93"
    },
    "category_id": "keto-shakes",
    "main_title": "Keto Shakes",
    "secondary_title": "Leto Shakes --Detox smoothies for weight loss",
    "main_description": "eto Shakes -- Healthy smoothies for weight loss are made with the right blend of weight loss foods that are scientifically proven to decrease body fat. Some of the common ingredients we include in these smoothies for weight loss are: protein powder for weight loss: these powders are low in sugar or other sweeteners, low in calories, and rich in high-quality protein that, in combination with strength exercises, will help build metabolism-boosting muscle mass. healthy fats: healthy fats like nut butters, avocado, and MCT oil will help to slow digestion to keep you fuller longer to prevent overeating. fiber: consuming fiber-rich ingredients like chia seeds, flaxseeds, hemp seeds, leafy greens, and oats can help prevent spikes in blood sugar that can lead to the storage of carbs as fat. low sugar: fruit is the base of all smoothies, and because fruit naturally contains sugar, there's no need to add extra sweeteners like honey, orange juice, or frozen yogurt that only serve to add empty calories",
    "secondary_description": "eto Shakes  Healthy smoothies for weight loss are made with the right blend of weight loss foods that are scientifically proven to decrease body fat. Some of the common ingredients we include in these smoothies for weight loss are: protein powder for weight loss: these powders are low in sugar or other sweeteners, low in calories, and rich in high-quality protein that, in combination with strength exercises, will help build metabolism-boosting muscle mass. healthy fats: healthy fats like nut butters, avocado, and MCT oil will help to slow digestion to keep you fuller longer to prevent overeating. fiber: consuming fiber-rich ingredients like chia seeds, flaxseeds, hemp seeds, leafy greens, and oats can help prevent spikes in blood sugar that can lead to the storage of carbs as fat. low sugar: fruit is the base of all smoothies, and because fruit naturally contains sugar, there's no need to add extra sweeteners like honey, orange juice, or frozen yogurt that only serve to add empty calories",
    "items": [
      {
        "title": "Simple + Keto Shakes",
        "description": "MHigh Calorie Protein Shakes the day as opposed to eating 3 larger meals. I eat to break up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      },
      {
        "title": "22Simple + Keto Shakes",
        "description": "High Calorie Protein Shakes the day as opposed to eating 3 larger meals. I eat to break up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      },
      {
        "title": "33Simple + Keto Shakes",
        "description": "MHigh Calorie Protein Shakes the day as opposed to eating 3 larger meals. I eat to break up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      }
    ],
    "category_banner_description": "We have [count] recipes  - Keto Shakes",
    "category_banner_img": "https://storage.googleapis.com/smoothie_bucket/banners/Keto%20Shakes.png",
    "preview_img": "https://storage.googleapis.com/smoothie_bucket/category-cards/homepage_section_1_3.png",
    "meta_data": {
      "title": "Best Keto Shakes Recipes",
      "description": "Each keto shakes recipe is packed with simple ingredients, powerful nutrition, and is ready instantly. High Protein. Low Carbs. Smooth, creamy, and rich smoothie and shake recipes.",
      "keyword_group": "Keto Shakes"
    }
  }
  {
    "_id": {
      "$oid": "6190d05ff206a49fada18da5"
    },
    "category_id": "pre-workout-shakes",
    "main_title": "Pre Workout Shakes",
    "secondary_title": "LPre Workout Shakes --Detox smoothies for weight loss",
    "main_description": "Pre Workout Shakes-- Healthy smoothies for weight loss are made with the right blend of weight loss foods that are scientifically proven to decrease body fat. Some of the common ingredients we include in these smoothies for weight loss are: protein powder for weight loss: these powders are low in sugar or other sweeteners, low in calories, and rich in high-quality protein that, in combination with strength exercises, will help build metabolism-boosting muscle mass. healthy fats: healthy fats like nut butters, avocado, and MCT oil will help to slow digestion to keep you fuller longer to prevent overeating. fiber: consuming fiber-rich ingredients like chia seeds, flaxseeds, hemp seeds, leafy greens, and oats can help prevent spikes in blood sugar that can lead to the storage of carbs as fat. low sugar: fruit is the base of all smoothies, and because fruit naturally contains sugar, there's no need to add extra sweeteners like honey, orange juice, or frozen yogurt that only serve to add empty calories",
    "secondary_description": "Pre Workout Shakesfor weight loss are made with the right blend of weight loss foods that are scientifically proven to decrease body fat. Some of the common ingredients we include in these smoothies for weight loss are: protein powder for weight loss: these powders are low in sugar or other sweeteners, low in calories, and rich in high-quality protein that, in combination with strength exercises, will help build metabolism-boosting muscle mass. healthy fats: healthy fats like nut butters, avocado, and MCT oil will help to slow digestion to keep you fuller longer to prevent overeating. fiber: consuming fiber-rich ingredients like chia seeds, flaxseeds, hemp seeds, leafy greens, and oats can help prevent spikes in blood sugar that can lead to the storage of carbs as fat. low sugar: fruit is the base of all smoothies, and because fruit naturally contains sugar, there's no need to add extra sweeteners like honey, orange juice, or frozen yogurt that only serve to add empty calories",
    "items": [
      {
        "title": "Simple + Pre Workout Shakes",
        "description": "MHigh Calorie Protein Shakes the day as opposed to eating 3 larger meals. I eat to break up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      },
      {
        "title": "22Simple + Pre Workout Shakes",
        "description": "High Calorie Protein Shakes the day as opposed to eating 3 larger meals. I eat to break up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      },
      {
        "title": "33Simple + Pre Workout Shakes",
        "description": "MHigh Calorie Protein Shakes the day as opposed to eating 3 larger meals. I eat to break up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      }
    ],
    "category_banner_description": "We have [count] recipes  - Pre Workout Shakes",
    "category_banner_img": "https://storage.googleapis.com/smoothie_bucket/banners/pre-workout-shakes.png",
    "preview_img": "https://storage.googleapis.com/smoothie_bucket/category-cards/homepage_section_1_4.png",
    "meta_data": {
      "title": "Best Pre Workout Smoothie & Shakes Recipes",
      "description": "Each pre workout smoothies recipe is packed with simple ingredients, powerful nutrition, and is ready instantly. High Protein. Low Carbs. Smooth, creamy, and rich smoothie and shake recipes",
      "keyword_group": "Pre Workout Smoothie"
    }
  }
  {
    "_id": {
      "$oid": "6190d0a9f206a49fada18db9"
    },
    "category_id": "weight-gain-shakes",
    "main_title": "Weight Gain Shakes",
    "secondary_title": "Weight Gain Shakes --Detox smoothies for weight loss",
    "main_description": "PWeight Gain Shakes-- Healthy smoothies for weight loss are made with the right blend of weight loss foods that are scientifically proven to decrease body fat. Some of the common ingredients we include in these smoothies for weight loss are: protein powder for weight loss: these powders are low in sugar or other sweeteners, low in calories, and rich in high-quality protein that, in combination with strength exercises, will help build metabolism-boosting muscle mass. healthy fats: healthy fats like nut butters, avocado, and MCT oil will help to slow digestion to keep you fuller longer to prevent overeating. fiber: consuming fiber-rich ingredients like chia seeds, flaxseeds, hemp seeds, leafy greens, and oats can help prevent spikes in blood sugar that can lead to the storage of carbs as fat. low sugar: fruit is the base of all smoothies, and because fruit naturally contains sugar, there's no need to add extra sweeteners like honey, orange juice, or frozen yogurt that only serve to add empty calories",
    "secondary_description": "Weight Gain Shakes are made with the right blend of weight loss foods that are scientifically proven to decrease body fat. Some of the common ingredients we include in these smoothies for weight loss are: protein powder for weight loss: these powders are low in sugar or other sweeteners, low in calories, and rich in high-quality protein that, in combination with strength exercises, will help build metabolism-boosting muscle mass. healthy fats: healthy fats like nut butters, avocado, and MCT oil will help to slow digestion to keep you fuller longer to prevent overeating. fiber: consuming fiber-rich ingredients like chia seeds, flaxseeds, hemp seeds, leafy greens, and oats can help prevent spikes in blood sugar that can lead to the storage of carbs as fat. low sugar: fruit is the base of all smoothies, and because fruit naturally contains sugar, there's no need to add extra sweeteners like honey, orange juice, or frozen yogurt that only serve to add empty calories",
    "items": [
      {
        "title": "Simple + Weight Gain Shakes",
        "description": "MHigh Calorie Protein Shakes the day as opposed to eating 3 larger meals. I eat to break up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      },
      {
        "title": "Weight Gain Shakes",
        "description": "High Calorie Protein Shakes the day as opposed to eating 3 larger meals. I eat to break up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      },
      {
        "title": "Weight Gain Shakes",
        "description": "Weight Gain Shakes as opposed to eating 3 larger meals. I eat to break up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      }
    ],
    "category_banner_description": "We have [count] recipes  - Weight Gain Shakes",
    "category_banner_img": "https://storage.googleapis.com/smoothie_bucket/banners/weight-gain-shakes.png",
    "preview_img": "https://storage.googleapis.com/smoothie_bucket/category-cards/homepage_section_2_1.png",
    "meta_data": {
      "title": "Best Weight Gain Shakes Recipes",
      "description": "Each weight gain shakes is packed with simple ingredients, powerful nutrition, and is ready instantly. High Protein. Low Carbs. Smooth, creamy, and rich smoothie and shake recipes.",
      "keyword_group": "Weight Gain Shakes"
    }
  }
  {
    "_id": {
      "$oid": "6190d148f206a49fada18de8"
    },
    "category_id": "plant-based-protein-shake",
    "main_title": "Plant Based Protein Shake",
    "secondary_title": "Plant Based Protein Shake",
    "main_description": "Plant Based Protein Shake the right blend of weight loss foods that are scientifically proven to decrease body fat. Some of the common ingredients we include in these smoothies for weight loss are: protein powder for weight loss: these powders are low in sugar or other sweeteners, low in calories, and rich in high-quality protein that, in combination with strength exercises, will help build metabolism-boosting muscle mass. healthy fats: healthy fats like nut butters, avocado, and MCT oil will help to slow digestion to keep you fuller longer to prevent overeating. fiber: consuming fiber-rich ingredients like chia seeds, flaxseeds, hemp seeds, leafy greens, and oats can help prevent spikes in blood sugar that can lead to the storage of carbs as fat. low sugar: fruit is the base of all smoothies, and because fruit naturally contains sugar, there's no need to add extra sweeteners like honey, orange juice, or frozen yogurt that only serve to add empty calories",
    "secondary_description": "Plant Based Protein Shake in these smoothies for weight loss are: protein powder for weight loss: these powders are low in sugar or other sweeteners, low in calories, and rich in high-quality protein that, in combination with strength exercises, will help build metabolism-boosting muscle mass. healthy fats: healthy fats like nut butters, avocado, and MCT oil will help to slow digestion to keep you fuller longer to prevent overeating. fiber: consuming fiber-rich ingredients like chia seeds, flaxseeds, hemp seeds, leafy greens, and oats can help prevent spikes in blood sugar that can lead to the storage of carbs as fat. low sugar: fruit is the base of all smoothies, and because fruit naturally contains sugar, there's no need to add extra sweeteners like honey, orange juice, or frozen yogurt that only serve to add empty calories",
    "items": [
      {
        "title": "Plant Based Protein Shake!!!!",
        "description": " Plant Based Protein Shake 3 larger meals. I eat to break up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      },
      {
        "title": "Plant Based Protein Shake",
        "description": "High Calorie Protein Shakes the day as opposed to eating 3 larger meals. I eat to break up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      },
      {
        "title": "Plant Based Protein Shake",
        "description": "Weight Loss Shakes 3 larger meals. I eat to break up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      }
    ],
    "category_banner_description": "We have [count] recipes  - Plant Based Protein Shake",
    "category_banner_img": "https://storage.googleapis.com/smoothie_bucket/banners/plant-based-protein-shake.png",
    "preview_img": "https://storage.googleapis.com/smoothie_bucket/category-cards/homepage_section_2_3.png",
    "meta_data": {
      "title": "Best Plant Based Protein Shakes Recipes",
      "description": "Each plant based protein shakes recipes is packed with simple ingredients, powerful nutrition, and is ready instantly. High Protein. Low Carbs. Smooth, creamy, and rich smoothie and shake recipes.",
      "keyword_group": "Plant Based Protein Shake"
    }
  }
  {
    "_id": {
      "$oid": "6190d19bf206a49fada18dfd"
    },
    "category_id": "casein-protein-shakes",
    "main_title": "Casein Protein Shakes",
    "secondary_title": "Casein Protein Shakes",
    "main_description": "Casein Protein Shakes right blend of weight loss foods that are scientifically proven to decrease body fat. Some of the common ingredients we include in these smoothies for weight loss are: protein powder for weight loss: these powders are low in sugar or other sweeteners, low in calories, and rich in high-quality protein that, in combination with strength exercises, will help build metabolism-boosting muscle mass. healthy fats: healthy fats like nut butters, avocado, and MCT oil will help to slow digestion to keep you fuller longer to prevent overeating. fiber: consuming fiber-rich ingredients like chia seeds, flaxseeds, hemp seeds, leafy greens, and oats can help prevent spikes in blood sugar that can lead to the storage of carbs as fat. low sugar: fruit is the base of all smoothies, and because fruit naturally contains sugar, there's no need to add extra sweeteners like honey, orange juice, or frozen yogurt that only serve to add empty calories",
    "secondary_description": "Casein Protein Shakesin these smoothies for weight loss are: protein powder for weight loss: these powders are low in sugar or other sweeteners, low in calories, and rich in high-quality protein that, in combination with strength exercises, will help build metabolism-boosting muscle mass. healthy fats: healthy fats like nut butters, avocado, and MCT oil will help to slow digestion to keep you fuller longer to prevent overeating. fiber: consuming fiber-rich ingredients like chia seeds, flaxseeds, hemp seeds, leafy greens, and oats can help prevent spikes in blood sugar that can lead to the storage of carbs as fat. low sugar: fruit is the base of all smoothies, and because fruit naturally contains sugar, there's no need to add extra sweeteners like honey, orange juice, or frozen yogurt that only serve to add empty calories",
    "items": [
      {
        "title": "Casein Protein Shakes!!!!",
        "description": " Plant Based Protein Shake 3 larger meals. I eat to break up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      },
      {
        "title": "Casein Protein Shakes",
        "description": "High Calorie Protein Shakes the day as opposed to eating 3 larger meals. I eat to break up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      },
      {
        "title": "Casein Protein Shakes",
        "description": "Weight Loss Shakes 3 larger meals. I eat to break up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      }
    ],
    "category_banner_description": "We have [count] recipes  - PCasein Protein Shakes",
    "category_banner_img": "https://storage.googleapis.com/smoothie_bucket/banners/Casein%20Protein%20Shakes.png",
    "preview_img": "https://storage.googleapis.com/smoothie_bucket/category-cards/homepage_section_2_4.png",
    "meta_data": {
      "title": "Best Casein Protein Recipes For Weight Loss",
      "description": "Each casein protein recipe is packed with simple ingredients, powerful nutrition, and is ready instantly. High Protein. Low Carbs. Smooth, creamy, and rich smoothie and shake recipes.",
      "keyword_group": "Plant Based Protein Shake"
    }
  }
  {
    "_id": {
      "$oid": "6190d1d7f206a49fada18e0e"
    },
    "category_id": "fat-burning-smoothie",
    "main_title": "Fat Burning Smoothie",
    "secondary_title": "Fat Burning Smoothie",
    "main_description": "Fat Burning Smoothie weight loss foods that are scientifically proven to decrease body fat. Some of the common ingredients we include in these smoothies for weight loss are: protein powder for weight loss: these powders are low in sugar or other sweeteners, low in calories, and rich in high-quality protein that, in combination with strength exercises, will help build metabolism-boosting muscle mass. healthy fats: healthy fats like nut butters, avocado, and MCT oil will help to slow digestion to keep you fuller longer to prevent overeating. fiber: consuming fiber-rich ingredients like chia seeds, flaxseeds, hemp seeds, leafy greens, and oats can help prevent spikes in blood sugar that can lead to the storage of carbs as fat. low sugar: fruit is the base of all smoothies, and because fruit naturally contains sugar, there's no need to add extra sweeteners like honey, orange juice, or frozen yogurt that only serve to add empty calories",
    "secondary_description": "Fat Burning Smoothie smoothies for weight loss are: protein powder for weight loss: these powders are low in sugar or other sweeteners, low in calories, and rich in high-quality protein that, in combination with strength exercises, will help build metabolism-boosting muscle mass. healthy fats: healthy fats like nut butters, avocado, and MCT oil will help to slow digestion to keep you fuller longer to prevent overeating. fiber: consuming fiber-rich ingredients like chia seeds, flaxseeds, hemp seeds, leafy greens, and oats can help prevent spikes in blood sugar that can lead to the storage of carbs as fat. low sugar: fruit is the base of all smoothies, and because fruit naturally contains sugar, there's no need to add extra sweeteners like honey, orange juice, or frozen yogurt that only serve to add empty calories",
    "items": [
      {
        "title": "Fat Burning Smoothie!!!",
        "description": " Plant Based Protein Shake 3 larger meals. I eat to break up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      },
      {
        "title": "Fat Burning Smoothie",
        "description": "High Calorie Protein Shakes the day as opposed to eating 3 larger meals. I eat to break up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      },
      {
        "title": "Fat Burning Smoothie",
        "description": "Weight Loss Shakes 3 larger meals. I eat to break up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      }
    ],
    "category_banner_description": "We have [count] recipes  - Fat Burning Smoothie",
    "category_banner_img": "https://storage.googleapis.com/smoothie_bucket/banners/fat-burning-smoothie.png",
    "preview_img": "https://storage.googleapis.com/smoothie_bucket/category-cards/homepage_section_1_1.png",
    "meta_data": {
      "title": "Best Fat Burning Smoothie",
      "description": "Each fat burning smoothie recipe is packed with simple ingredients, powerful nutrition, and is ready instantly. High Protein. Low Carbs. Smooth, creamy, and rich smoothie and shake recipes.",
      "keyword_group": "Fat Burning Smoothie"
    }
  }
  {
    "_id": {
      "$oid": "6190d258f206a49fada18e33"
    },
    "category_id": "anti-inflammatory-smoothies",
    "main_title": "Anti Inflammatory Smoothies",
    "secondary_title": "Anti Inflammatory Smoothies",
    "main_description": "Anti Inflammatory Smoothies scientifically proven to decrease body fat. Some of the common ingredients we include in these smoothies for weight loss are: protein powder for weight loss: these powders are low in sugar or other sweeteners, low in calories, and rich in high-quality protein that, in combination with strength exercises, will help build metabolism-boosting muscle mass. healthy fats: healthy fats like nut butters, avocado, and MCT oil will help to slow digestion to keep you fuller longer to prevent overeating. fiber: consuming fiber-rich ingredients like chia seeds, flaxseeds, hemp seeds, leafy greens, and oats can help prevent spikes in blood sugar that can lead to the storage of carbs as fat. low sugar: fruit is the base of all smoothies, and because fruit naturally contains sugar, there's no need to add extra sweeteners like honey, orange juice, or frozen yogurt that only serve to add empty calories",
    "secondary_description": "Anti Inflammatory Smoothies powder for weight loss: these powders are low in sugar or other sweeteners, low in calories, and rich in high-quality protein that, in combination with strength exercises, will help build metabolism-boosting muscle mass. healthy fats: healthy fats like nut butters, avocado, and MCT oil will help to slow digestion to keep you fuller longer to prevent overeating. fiber: consuming fiber-rich ingredients like chia seeds, flaxseeds, hemp seeds, leafy greens, and oats can help prevent spikes in blood sugar that can lead to the storage of carbs as fat. low sugar: fruit is the base of all smoothies, and because fruit naturally contains sugar, there's no need to add extra sweeteners like honey, orange juice, or frozen yogurt that only serve to add empty calories",
    "items": [
      {
        "title": "Anti Inflammatory Smoothies!!!",
        "description": " Plant Based Protein Shake 3 larger meals. I eat to break up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      },
      {
        "title": "Anti Inflammatory Smoothies",
        "description": "High Calorie Protein Shakes the day as opposed to eating 3 larger meals. I eat to break up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      },
      {
        "title": "Anti Inflammatory Smoothies",
        "description": "Weight Loss Shakes 3 larger meals. I eat to break up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      }
    ],
    "category_banner_description": "We have [count] recipes  - Anti Inflammatory Smoothies",
    "category_banner_img": "https://storage.googleapis.com/smoothie_bucket/banners/Anti%20Inflammatory%20Smoothies.png",
    "preview_img": "https://storage.googleapis.com/smoothie_bucket/category-cards/homepage_section_1_3.png",
    "meta_data": {
      "title": "Healthy Anti Inflammatory Smoothie",
      "description": "Each Anti Inflammatory smoothie recipe is packed with simple ingredients, powerful nutrition, and is ready instantly. High Protein. Low Carbs. Smooth, creamy, and rich smoothie and shake recipes.",
      "keyword_group": "Anti Inflammatory Smoothie"
    }
  }
  {
    "_id": {
      "$oid": "6190d292f206a49fada18e48"
    },
    "category_id": "superfood-smoothies",
    "main_title": "Superfood Smoothies",
    "secondary_title": "Superfood Smoothies",
    "main_description": "Superfood Smoothies scientifically proven to decrease body fat. Some of the common ingredients we include in these smoothies for weight loss are: protein powder for weight loss: these powders are low in sugar or other sweeteners, low in calories, and rich in high-quality protein that, in combination with strength exercises, will help build metabolism-boosting muscle mass. healthy fats: healthy fats like nut butters, avocado, and MCT oil will help to slow digestion to keep you fuller longer to prevent overeating. fiber: consuming fiber-rich ingredients like chia seeds, flaxseeds, hemp seeds, leafy greens, and oats can help prevent spikes in blood sugar that can lead to the storage of carbs as fat. low sugar: fruit is the base of all smoothies, and because fruit naturally contains sugar, there's no need to add extra sweeteners like honey, orange juice, or frozen yogurt that only serve to add empty calories",
    "secondary_description": "Superfood Smoothies powder for weight loss: these powders are low in sugar or other sweeteners, low in calories, and rich in high-quality protein that, in combination with strength exercises, will help build metabolism-boosting muscle mass. healthy fats: healthy fats like nut butters, avocado, and MCT oil will help to slow digestion to keep you fuller longer to prevent overeating. fiber: consuming fiber-rich ingredients like chia seeds, flaxseeds, hemp seeds, leafy greens, and oats can help prevent spikes in blood sugar that can lead to the storage of carbs as fat. low sugar: fruit is the base of all smoothies, and because fruit naturally contains sugar, there's no need to add extra sweeteners like honey, orange juice, or frozen yogurt that only serve to add empty calories",
    "items": [
      {
        "title": "Superfood Smoothies!!",
        "description": " Plant Based Protein Shake 3 larger meals. I eat to break up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      },
      {
        "title": "Superfood Smoothies",
        "description": "High Calorie Protein Shakes the day as opposed to eating 3 larger meals. I eat to break up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      },
      {
        "title": "Superfood Smoothies",
        "description": "Weight Loss Shakes 3 larger meals. I eat to break up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      }
    ],
    "category_banner_description": "We have [count] recipes  - Superfood Smoothies",
    "category_banner_img": "https://storage.googleapis.com/smoothie_bucket/banners/Superfood%20Smoothies.png",
    "preview_img": "https://storage.googleapis.com/smoothie_bucket/category-cards/homepage_section_1_4.png",
    "meta_data": {
      "title": "Healthy Superfoods Smoothie Recipes",
      "description": "Each superfoods smoothie recipe is packed with simple ingredients, powerful nutrition, and is ready instantly. High Protein. Low Carbs. Smooth, creamy, and rich smoothie and shake recipes.",
      "keyword_group": "Superfoods Smoothies"
    }
  }
  {
    "_id": {
      "$oid": "61f58177dc1849fe5fc07e03"
    },
    "category_id": "pumpkin-protein-shake",
    "main_title": "Pumpkin Protein Shake",
    "secondary_title": "Pumpkin Protein Shake",
    "main_description": "Pumpkin Protein Shake scientifically proven to decrease body fat. Some of the common ingredients we include in these smoothies for weight loss are: protein powder for weight loss: these powders are low in sugar or other sweeteners, low in calories, and rich in high-quality protein that, in combination with strength exercises, will help build metabolism-boosting muscle mass. healthy fats: healthy fats like nut butters, avocado, and MCT oil will help to slow digestion to keep you fuller longer to prevent overeating. fiber: consuming fiber-rich ingredients like chia seeds, flaxseeds, hemp seeds, leafy greens, and oats can help prevent spikes in blood sugar that can lead to the storage of carbs as fat. low sugar: fruit is the base of all smoothies, and because fruit naturally contains sugar, there's no need to add extra sweeteners like honey, orange juice, or frozen yogurt that only serve to add empty calories",
    "secondary_description": "Pumpkin Protein Shake for weight loss: these powders are low in sugar or other sweeteners, low in calories, and rich in high-quality protein that, in combination with strength exercises, will help build metabolism-boosting muscle mass. healthy fats: healthy fats like nut butters, avocado, and MCT oil will help to slow digestion to keep you fuller longer to prevent overeating. fiber: consuming fiber-rich ingredients like chia seeds, flaxseeds, hemp seeds, leafy greens, and oats can help prevent spikes in blood sugar that can lead to the storage of carbs as fat. low sugar: fruit is the base of all smoothies, and because fruit naturally contains sugar, there's no need to add extra sweeteners like honey, orange juice, or frozen yogurt that only serve to add empty calories",
    "items": [
      {
        "title": "Pumpkin Protein Shake",
        "description": "Pumpkin Protein Shake larger meals. I eat to break up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      },
      {
        "title": "Pumpkin Protein Shake",
        "description": "Pumpkin Protein Shakeday as opposed to eating 3 larger meals. I eat to break up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      },
      {
        "title": "Pumpkin Protein Shake",
        "description": "Weight Loss Shakes 3 larger meals. I eat to break up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      }
    ],
    "category_banner_description": "We have [count] recipes  - Pumpkin Protein Shake",
    "category_banner_img": "https://storage.googleapis.com/smoothie_bucket/banners/Pumpkin%20Protein%20Shake.jpg",
    "preview_img": "https://storage.googleapis.com/smoothie_bucket/category-cards/homepage_section_1_4.png",
    "meta_data": {
      "title": "Pumpkin Protein Shake Recipes",
      "description": "Each pumpkin protein shake recipe is packed with simple ingredients, powerful nutrition, and is ready instantly. High Protein. Low Carbs. Smooth, creamy, and rich smoothie and shake recipes.\n",
      "keyword_group": "Pumpkin Protein Shake"
    }
  }
  {
    "_id": {
      "$oid": "61f583e2dc1849fe5fc07e96"
    },
    "category_id": "peanut-butter-shake",
    "main_title": "Peanut Butter Shake",
    "secondary_title": "Peanut Butter Shake",
    "main_description": "Peanut Butter Shake Some of the common ingredients we include in these smoothies for weight loss are: protein powder for weight loss: these powders are low in sugar or other sweeteners, low in calories, and rich in high-quality protein that, in combination with strength exercises, will help build metabolism-boosting muscle mass. healthy fats: healthy fats like nut butters, avocado, and MCT oil will help to slow digestion to keep you fuller longer to prevent overeating. fiber: consuming fiber-rich ingredients like chia seeds, flaxseeds, hemp seeds, leafy greens, and oats can help prevent spikes in blood sugar that can lead to the storage of carbs as fat. low sugar: fruit is the base of all smoothies, and because fruit naturally contains sugar, there's no need to add extra sweeteners like honey, orange juice, or frozen yogurt that only serve to add empty calories",
    "secondary_description": "Peanut Butter Shakeare low in sugar or other sweeteners, low in calories, and rich in high-quality protein that, in combination with strength exercises, will help build metabolism-boosting muscle mass. healthy fats: healthy fats like nut butters, avocado, and MCT oil will help to slow digestion to keep you fuller longer to prevent overeating. fiber: consuming fiber-rich ingredients like chia seeds, flaxseeds, hemp seeds, leafy greens, and oats can help prevent spikes in blood sugar that can lead to the storage of carbs as fat. low sugar: fruit is the base of all smoothies, and because fruit naturally contains sugar, there's no need to add extra sweeteners like honey, orange juice, or frozen yogurt that only serve to add empty calories",
    "items": [
      {
        "title": "Peanut Butter Shake",
        "description": "Peanut Butter Shakein between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      },
      {
        "title": "Peanut Butter Shake",
        "description": "Peanut Butter Shakebreak up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      },
      {
        "title": "Peanut Butter Shake",
        "description": "Peanut Butter Shake to break up my day in between work and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      }
    ],
    "category_banner_description": "We have [count] recipes  - Peanut Butter Shake",
    "category_banner_img": "https://storage.googleapis.com/smoothie_bucket/banners/Peanut%20Butter%20Shake.png",
    "preview_img": "https://storage.googleapis.com/smoothie_bucket/category-cards/homepage_section_1_4.png",
    "meta_data": {
      "title": "Best Peanut Butter Protein Shake Recipes",
      "description": "Each peanut butter protein shake recipe is packed with simple ingredients, powerful nutrition, and is ready instantly. High Protein. Low Carbs. Smooth, creamy, and rich smoothie and shake recipes.",
      "keyword_group": "Peanut Butter Protein Shake"
    }
  }
  {
    "_id": {
      "$oid": "61f584f1dc1849fe5fc07edc"
    },
    "category_id": "chocolate-protein-shake",
    "main_title": "Chocolate Protein Shake",
    "secondary_title": "Chocolate Protein Shake",
    "main_description": "Chocolate Protein Shake low in calories, and rich in high-quality protein that, in combination with strength exercises, will help build metabolism-boosting muscle mass. healthy fats: healthy fats like nut butters, avocado, and MCT oil will help to slow digestion to keep you fuller longer to prevent overeating. fiber: consuming fiber-rich ingredients like chia seeds, flaxseeds, hemp seeds, leafy greens, and oats can help prevent spikes in blood sugar that can lead to the storage of carbs as fat. low sugar: fruit is the base of all smoothies, and because fruit naturally contains sugar, there's no need to add extra sweeteners like honey, orange juice, or frozen yogurt that only serve to add empty calories",
    "secondary_description": "Chocolate Protein Shake build metabolism-boosting muscle mass. healthy fats: healthy fats like nut butters, avocado, and MCT oil will help to slow digestion to keep you fuller longer to prevent overeating. fiber: consuming fiber-rich ingredients like chia seeds, flaxseeds, hemp seeds, leafy greens, and oats can help prevent spikes in blood sugar that can lead to the storage of carbs as fat. low sugar: fruit is the base of all smoothies, and because fruit naturally contains sugar, there's no need to add extra sweeteners like honey, orange juice, or frozen yogurt that only serve to add empty calories",
    "items": [
      {
        "title": "Chocolate Protein Shake",
        "description": "Chocolate Protein Shake I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      },
      {
        "title": "Chocolate Protein Shake",
        "description": "Chocolate Protein Shake These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      },
      {
        "title": "Chocolate Protein Shake",
        "description": "Chocolate Protein Shakework and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      }
    ],
    "category_banner_description": "We have [count] recipes  - Chocolate Protein Shake",
    "category_banner_img": "https://storage.googleapis.com/smoothie_bucket/banners/Chocolate%20Protein%20Shake.png",
    "preview_img": "https://storage.googleapis.com/smoothie_bucket/category-cards/homepage_section_1_4.png",
    "meta_data": {
      "title": "Best Chocolate Protein Shake Recipes",
      "description": " Each chocolate protein shake recipe is packed with simple ingredients, powerful nutrition, and is ready instantly. High Protein. Low Carbs. Smooth, creamy, and rich smoothie and shake recipes.",
      "keyword_group": "Chocolate Protein Shake Recipes"
    }
  }
  {
    "_id": {
      "$oid": "61f585c1dc1849fe5fc07f19"
    },
    "category_id": "strawberry-protein-shake",
    "main_title": "Strawberry Protein Shake",
    "secondary_title": "Strawberry Protein Shake",
    "main_description": "Strawberry Protein Shake healthy fats: healthy fats like nut butters, avocado, and MCT oil will help to slow digestion to keep you fuller longer to prevent overeating. fiber: consuming fiber-rich ingredients like chia seeds, flaxseeds, hemp seeds, leafy greens, and oats can help prevent spikes in blood sugar that can lead to the storage of carbs as fat. low sugar: fruit is the base of all smoothies, and because fruit naturally contains sugar, there's no need to add extra sweeteners like honey, orange juice, or frozen yogurt that only serve to add empty calories",
    "secondary_description": "Strawberry Protein Shakedigestion to keep you fuller longer to prevent overeating. fiber: consuming fiber-rich ingredients like chia seeds, flaxseeds, hemp seeds, leafy greens, and oats can help prevent spikes in blood sugar that can lead to the storage of carbs as fat. low sugar: fruit is the base of all smoothies, and because fruit naturally contains sugar, there's no need to add extra sweeteners like honey, orange juice, or frozen yogurt that only serve to add empty calories",
    "items": [
      {
        "title": "Strawberry Protein Shake",
        "description": "Strawberry Protein Shake to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      },
      {
        "title": "Strawberry Protein Shake",
        "description": "Strawberry Protein Shake snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      },
      {
        "title": "Strawberry Protein Shake",
        "description": "Strawberry Protein Shake and errands, so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      }
    ],
    "category_banner_description": "We have [count] recipes  - Strawberry Protein Shake",
    "category_banner_img": "https://storage.googleapis.com/smoothie_bucket/banners/Strawberry%20Protein%20Shake.png",
    "preview_img": "https://storage.googleapis.com/smoothie_bucket/category-cards/homepage_section_1_4.png",
    "meta_data": {
      "title": "Best Strawberry Protein Shake Recipes",
      "description": "Each strawberry protein shake recipe is packed with simple ingredients, powerful nutrition, and is ready instantly. High Protein. Low Carbs. Smooth, creamy, and rich smoothie and shake recipes.",
      "keyword_group": "Strawberry Protein Shake Recipes"
    }
  }
  {
    "_id": {
      "$oid": "61f58743dc1849fe5fc07f7b"
    },
    "category_id": "meal-replacement-smoothies",
    "main_title": "Meal Replacement Smoothies",
    "secondary_title": "Meal Replacement Smoothies",
    "main_description": "Meal Replacement Smoothiesfats like nut butters, avocado, and MCT oil will help to slow digestion to keep you fuller longer to prevent overeating. fiber: consuming fiber-rich ingredients like chia seeds, flaxseeds, hemp seeds, leafy greens, and oats can help prevent spikes in blood sugar that can lead to the storage of carbs as fat. low sugar: fruit is the base of all smoothies, and because fruit naturally contains sugar, there's no need to add extra sweeteners like honey, orange juice, or frozen yogurt that only serve to add empty calories",
    "secondary_description": "Meal Replacement Smoothies you fuller longer to prevent overeating. fiber: consuming fiber-rich ingredients like chia seeds, flaxseeds, hemp seeds, leafy greens, and oats can help prevent spikes in blood sugar that can lead to the storage of carbs as fat. low sugar: fruit is the base of all smoothies, and because fruit naturally contains sugar, there's no need to add extra sweeteners like honey, orange juice, or frozen yogurt that only serve to add empty calories",
    "items": [
      {
        "title": "Meal Replacement Smoothies",
        "description": "Meal Replacement Smoothies to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      },
      {
        "title": "Meal Replacement Smoothies",
        "description": "Meal Replacement Smoothies snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      },
      {
        "title": "Meal Replacement Smoothies",
        "description": "Meal Replacement Smoothies so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      }
    ],
    "category_banner_description": "We have [count] recipes  - Meal Replacement Smoothies",
    "category_banner_img": "https://storage.googleapis.com/smoothie_bucket/banners/Meal%20Replacement%20Smoothies.jpg",
    "preview_img": "https://storage.googleapis.com/smoothie_bucket/category-cards/homepage_section_1_4.png",
    "meta_data": {
      "title": "Healthy Meal Replacement Smoothies",
      "description": "Each meal replacement smoothie recipe is packed with simple ingredients, powerful nutrition, and is ready instantly. High Protein. Low Carbs. Smooth, creamy, and rich smoothie and shake recipes.",
      "keyword_group": "Meal Replacement Smoothies"
    }
  }
  {
    "_id": {
      "$oid": "61f587fddc1849fe5fc07fa8"
    },
    "category_id": "coffee-protein-shake",
    "main_title": "Coffee Protein Shake",
    "secondary_title": "Coffee Protein Shake",
    "main_description": "Coffee Protein Shake like nut butters, avocado, and MCT oil will help to slow digestion to keep you fuller longer to prevent overeating. fiber: consuming fiber-rich ingredients like chia seeds, flaxseeds, hemp seeds, leafy greens, and oats can help prevent spikes in blood sugar that can lead to the storage of carbs as fat. low sugar: fruit is the base of all smoothies, and because fruit naturally contains sugar, there's no need to add extra sweeteners like honey, orange juice, or frozen yogurt that only serve to add empty calories",
    "secondary_description": "Coffee Protein Shake you fuller longer to prevent overeating. fiber: consuming fiber-rich ingredients like chia seeds, flaxseeds, hemp seeds, leafy greens, and oats can help prevent spikes in blood sugar that can lead to the storage of carbs as fat. low sugar: fruit is the base of all smoothies, and because fruit naturally contains sugar, there's no need to add extra sweeteners like honey, orange juice, or frozen yogurt that only serve to add empty calories",
    "items": [
      {
        "title": "Coffee Protein Shake",
        "description": "Coffee Protein Shake to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      },
      {
        "title": "Coffee Protein Shake",
        "description": "Coffee Protein Shake snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      },
      {
        "title": "Coffee Protein Shake",
        "description": "Coffee Protein Shake so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      }
    ],
    "category_banner_description": "We have [count] recipes  - Coffee Protein Shake",
    "category_banner_img": "https://storage.googleapis.com/smoothie_bucket/banners/Coffee%20Protein%20Shake.png",
    "preview_img": "https://storage.googleapis.com/smoothie_bucket/category-cards/homepage_section_1_4.png",
    "meta_data": {
      "title": "Coffee Protein Shake Recipes",
      "description": "Each coffee protein shake recipe is packed with simple ingredients, powerful nutrition, and is ready instantly. High Protein. Low Carbs. Smooth, creamy, and rich smoothie and shake recipes.",
      "keyword_group": "Coffee Protein Shake"
    }
  }
  {
    "_id": {
      "$oid": "61f588b3dc1849fe5fc07fd3"
    },
    "category_id": "vegan-protein-shake",
    "main_title": "Vegan Protein Shake",
    "secondary_title": "Vegan Protein Shake",
    "main_description": "Vegan Protein Shake like nut butters, avocado, and MCT oil will help to slow digestion to keep you fuller longer to prevent overeating. fiber: consuming fiber-rich ingredients like chia seeds, flaxseeds, hemp seeds, leafy greens, and oats can help prevent spikes in blood sugar that can lead to the storage of carbs as fat. low sugar: fruit is the base of all smoothies, and because fruit naturally contains sugar, there's no need to add extra sweeteners like honey, orange juice, or frozen yogurt that only serve to add empty calories",
    "secondary_description": "Vegan Protein Shake you fuller longer to prevent overeating. fiber: consuming fiber-rich ingredients like chia seeds, flaxseeds, hemp seeds, leafy greens, and oats can help prevent spikes in blood sugar that can lead to the storage of carbs as fat. low sugar: fruit is the base of all smoothies, and because fruit naturally contains sugar, there's no need to add extra sweeteners like honey, orange juice, or frozen yogurt that only serve to add empty calories",
    "items": [
      {
        "title": "Vegan Protein Shake",
        "description": "Vegan Protein Shake to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      },
      {
        "title": "Vegan Protein Shake",
        "description": "Vegan Protein Shake snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      },
      {
        "title": "Vegan Protein Shake",
        "description": "Vegan Protein Shake so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      }
    ],
    "category_banner_description": "We have [count] recipes  - Vegan Protein Shake",
    "category_banner_img": "https://storage.googleapis.com/smoothie_bucket/banners/Vegan%20Protein%20Shake.png",
    "preview_img": "https://storage.googleapis.com/smoothie_bucket/category-cards/homepage_section_1_4.png",
    "meta_data": {
      "title": "Best Vegan Protein Shake Recipes",
      "description": "Each vegan protein shake recipe is packed with simple ingredients, powerful nutrition, and is ready instantly. High Protein. Low Carbs. Smooth, creamy, and rich smoothie and shake recipes.",
      "keyword_group": "Vegan Protein Shake"
    }
  }
  {
    "_id": {
      "$oid": "61f58a62dc1849fe5fc08049"
    },
    "category_id": "cookies-and-cream-protein-shake",
    "main_title": "Cookies And Cream Protein Shake",
    "secondary_title": "Cookies And Cream Protein Shake",
    "main_description": "Cookies And Cream Protein Shakelike nut butters, avocado, and MCT oil will help to slow digestion to keep you fuller longer to prevent overeating. fiber: consuming fiber-rich ingredients like chia seeds, flaxseeds, hemp seeds, leafy greens, and oats can help prevent spikes in blood sugar that can lead to the storage of carbs as fat. low sugar: fruit is the base of all smoothies, and because fruit naturally contains sugar, there's no need to add extra sweeteners like honey, orange juice, or frozen yogurt that only serve to add empty calories",
    "secondary_description": "Cookies And Cream Protein Shake you fuller longer to prevent overeating. fiber: consuming fiber-rich ingredients like chia seeds, flaxseeds, hemp seeds, leafy greens, and oats can help prevent spikes in blood sugar that can lead to the storage of carbs as fat. low sugar: fruit is the base of all smoothies, and because fruit naturally contains sugar, there's no need to add extra sweeteners like honey, orange juice, or frozen yogurt that only serve to add empty calories",
    "items": [
      {
        "title": "Cookies And Cream Protein Shake",
        "description": "Cookies And Cream Protein Shake to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      },
      {
        "title": "Cookies And Cream Protein Shake",
        "description": "Cookies And Cream Protein Shake snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      },
      {
        "title": "Cookies And Cream Protein Shake",
        "description": "Cookies And Cream Protein Shake so I need something to provide sustaining energy vs just satisfy my sweet tooth. These snack recipes are all great options for you to have on hand, and will nutritionally make you feel better about snacking."
      }
    ],
    "category_banner_description": "We have [count] recipes  - Cookies And Cream Protein Shake",
    "category_banner_img": "https://storage.googleapis.com/smoothie_bucket/banners/cookies-and-cream-protein-shake.png",
    "preview_img": "https://storage.googleapis.com/smoothie_bucket/category-cards/homepage_section_1_4.png",
    "meta_data": {
      "title": "Best ****Cookies And Cream Protein Shake Recipes",
      "description": "Each cookies and cream protein shake recipe is packed with simple ingredients, powerful nutrition, and is ready instantly. High Protein. Low Carbs. Smooth, creamy, and rich smoothie and shake recipes.",
      "keyword_group": "Cookies and Cream Protein Shake"
    }
  }
